# Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму.
# Пример:
# Для n = 6: [2.0, 2.25, 2.37037037037037, 2.44140625, 2.4883199999999994, 2.5216263717421135]


print('Введите число N')
n = int(input())
a = lambda x: (1+1/(x+1))**(x+1)
list = [a(i) for i in range(0, n)]
print(list)
print(round(sum(list), 3))
