# Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму.
# Пример:
# Для n = 6: [2.0, 2.25, 2.37037037037037, 2.44140625, 2.4883199999999994, 2.5216263717421135]


print('Введите число N')
n = int(input())
lis = [i for i in range(1,n+1)] #создание списка от 1 до N
a = 1
for a in range(n):
    lis[a] = (1+1/(a+1))**(a+1)
print(lis)
print(round(sum(lis), 3))
