# Напишите программу, которая по заданному номеру четверти 
# показывает диапазон возможных координат точек в этой четверти (x и y).

# print('Введите номер четверти')
# n = int(input())
# if n == 1:
#     print('x = (0; +∞) y = (0; +∞)')
# elif n == 2:
#     print('x = (0; +∞) y = (-∞; 0)')
# elif n == 3:
#     print('x = (-∞; 0) y = (-∞; 0)')
# elif n == 4:
#     print('x = (-∞; 0) y = (0; +∞)')

number = int(input()) # на строку ниже создаем словарь по ключу
d = {1: 'x = (0; +∞) y = (0; +∞)', 2: 'x = (0; +∞) y = (-∞; 0)', 3: 'x = (-∞; 0) y = (-∞; 0)', 4: 'x = (-∞; 0) y = (0; +∞)'}
print(d[number])